# InstanceFreeHostParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InstanceFreeHostParam Property
ParameterTypeId Class See Also
---
"Host"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InstanceFreeHostParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceFreeHostParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InstanceFreeHostParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace